practicals/practicals.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-16 tir 07:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Doctoral course: longitudinal causal inference</title>
<meta name="author" content="Thomas Alexander Gerds, University of Copenhagen" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="../src/bigblow_theme/css/hideshow.css"/>

</head>
<body>
<div id="preamble" class="status">
<br>Thomas Alexander Gerds, University of Copenhagen
</div>
<div id="content" class="content">
<h1 class="title">Doctoral course: longitudinal causal inference</h1>
<div id="outline-container-orgdaa7d17" class="outline-2">
<h2 id="orgdaa7d17"><span class="section-number-2">1.</span> Practical 1</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5fc0db8" class="outline-3">
<h3 id="org5fc0db8"><span class="section-number-3">1.1.</span> <span class="todo TODO">TODO</span> </h3>
<div class="outline-text-3" id="text-1-1">
<p>
Read the abstract of Robins &amp; Finkelstein (2000). Biometrics 56, pages
779&#x2013;788.  For your convenience the abstract is pasted in here.
</p>

<div class="foldable-example">
<div class="header">Abstract Robins & Finkelstein (2000) (click to expand)</div>
<div class="content">
<pre class="example" id="org587b650">
SUMMARY. AIDS Clinical Trial Group (ACTG) randomized trial 021
compared the effect of bactrim versus aerosolized pentamidine (AP) as
prophylaxis therapy for pneumocystis pneumonia (PCP) in AIDS patients.
Although patients randomized to the bactrim arm experienced a
significant delay in time to PCP, the survival experience in the two
arms was not significantly different (p = .32). In this paper, we
present evidence that bactrim therapy improves survival but that the
standard intent-to-treat comparison failed to detect this survival
advantage because a large fraction of the subjects either crossed over
to the other therapy or stopped therapy altogether. We obtain our
evidence of a beneficial bactrim effect on survival by artificially
regarding the subjects as dependently censored at the first time the
subject either stops or switches therapy; we then analyze the data
with the inverse probability of censoring weighted Kaplan-Meier and
Cox partial likelihood estimators of Robins (1993, Proceedings of the
Biopharmaceutical Section, American Statistical Association,
pp. 24-33) that adjust for dependent censoring by utilizing data
collected on time-dependent prognostic factors.
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4810971" class="outline-3">
<h3 id="org4810971"><span class="section-number-3">1.2.</span> <span class="todo TODO">TODO</span> </h3>
<div class="outline-text-3" id="text-1-2">
<p>
Read from the middle of the first column of page 780 starting with
   "More precisely, &#x2026;" until "&#x2026; their inverse probability of
   censoring weighted versions". For your convenience this part of the
   text is pasted in here.
</p>

<div class="foldable-example">
<div class="header">Page 780 Robins & Finkelstein (2000) (click to expand)</div>
<div class="content">
<pre class="example" id="orge800f3f">
More precisely, we will report four different causal analyses.

The first analysis is similar to a standard intent-to-treat anal-
ysis with mortality as the outcome; i.e., we compare mortal-
ity experience in the two treatment arms with death censored
only by loss to or end of follow-up. Thus, all 94 deaths are
regarded as failures. The novelty in the first analysis is that
we allow for the possibility of dependent censoring by loss to
follow-up.

In our second analysis, we compare mortality in the two
treatment arms while regarding a subject as dependently cen-
sored by the minimum of time to loss to follow-up and time to
treatment crossover. Thus, only the 73 of the 94 deaths that
occurred before a subject crossed over to the other arm are
included as failures; the other 21 deaths are regarded as cen-
sored. This analysis attempts to estimate what the survival
curves would have been if the possibility of crossover to the
other treatment arm after the development of PCP had been
eliminated from the treatment protocol.

In our third analysis, we compare the mortality in the two
treatment arms while regarding subjects as dependently cen-
sored at the minimum of time to loss to follow-up, time to
treatment crossover, and time to voluntarily stopping therapy
(for nonmedically related reasons). In this analysis, only the
52 of the 94 deaths in which subjects had neither crossed over
nor voluntarily stopped therapy are regarded as failures. For
public health purposes, this analysis may be preferred since
it attempts to estimate the survival benefit of bactrim com-
pared to aerosolized pentamidine had no subject voluntarily
stopped their assigned therapy without medical indication.

Our final analysis compares mortality in the two treatment
arms while regarding subjects as censored at the minimum of
time to loss to follow-up, crossover, or stopping therapy for
any reason. In this analysis, we are attempting to compare the
effect of bactrim versus aerosolized pentamidine on survival if
all subjects were forced to stay on their assigned therapy. Even
if we could successfully estimate this parameter, it would only
be of public health relevance if, as discussed above, the toxi-
cities that led to medically indicated termination of therapy
could be ameliorated with appropriate palliative therapy.

Since one would expect that the sickest patients would tend
to cross over or to stop therapy, it is clear that we must re-
gard censoring by crossover or stopping therapy as dependent.
However, Robins (1993) and Robins and Rotnitzky (1992)
showed that, if we have available data on all time-dependent
prognostic factors for mortality that independently predict
censoring, then one can correct for the dependence between
the censoring and failure by replacing the Kaplan-Meier es-
timator, log-rank test, and Cox partial likelihood estimator
of the ratio of the treatment-arm-specific mortality rates by
their inverse probability of censoring weighted versions.
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf8ec530" class="outline-3">
<h3 id="orgf8ec530"><span class="section-number-3">1.3.</span> <span class="todo TODO">TODO</span> </h3>
<div class="outline-text-3" id="text-1-3">
<p>
The authors describe 4 different causal analyses which differ
regarding how and when the followup data are censored. Describe the
corresponding 4 treatment regimens/protocols of a target trial (for
one of the treatments, e.g., bactrim). Write your description in a
document, e.g., a R-markdown or quarto document and discuss with your
classroom neighbors.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb670408" class="outline-2">
<h2 id="orgb670408"><span class="section-number-2">2.</span> Practical 2</h2>
<div class="outline-text-2" id="text-2">
<p>
Inspired by Robins &amp; Finkelstein (2000), we consider the following set
of uncensored categorical variables on an already discretized time scale
with 2 time intervals:
</p>

\begin{equation*}
X = (L_0,V_0,A_0,C_1,Y_1,D_1,L_1,V_1,A_1,C_2,Y_2,D_2)
\end{equation*}

<ul class="org-ul">
<li>\(L_0\) = Indicator of Karnofsky score below 75 before start of time interval 1</li>
<li>\(V_0\) = Indicator of Asthenia score above 2 before start of time interval 1</li>
<li>\(A_0\) = Initialize therapy with bactrim</li>
<li>\(B_0\) = Initialize therapy with  aerosolized pentamidine (AP)</li>
<li>\(C_1\) = Indicator of end of followup in time interval 1</li>
<li>\(Y_1\) = Indicator of pneumocystis pneumonia (PCP) event in time interval 1</li>
<li>\(D_1\) = Indicator of death in time interval 1</li>
<li>\(L_1\) = Indicator of Karnofsky score below 75 before start of time interval 2</li>
<li>\(V_1\) = Indicator of Asthenia score above 2 before start of time interval 2</li>
<li>\(A_1\) = Exposed to bactrim at end of time interval 1</li>
<li>\(A_2\) = Exposed to AP at end of time interval 1</li>
<li>\(C_2\) = Indicator of end of followup in time interval 2</li>
<li>\(Y_2\) = Indicator of pneumocystis pneumonia (PCP) event in time interval 2</li>
<li>\(D_2\) = Indicator of death in time interval 2</li>
</ul>
</div>
<div id="outline-container-org094a3b9" class="outline-3">
<h3 id="org094a3b9"><span class="section-number-3">2.1.</span> Intervention map</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>For each of the 4 protocols of Practical 1, define the intervention
map \(\pi^*\) which describes the treatment over time.</li>
</ul>
</div>
</div>
<div id="outline-container-orga0cd22c" class="outline-3">
<h3 id="orga0cd22c"><span class="section-number-3">2.2.</span> Modelling</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Read the following text about dimension reduction extracted from pages
  781-782 of Robins &amp; Finkelstein:
</p>

<div class="foldable-example">
<div class="header">Extracted text about dimension reduction from pages 781-782 Robins & Finkelstein (2000) (click to expand)</div>
<div class="content">
<pre class="example" id="org71178fb">
We kept only those prognostic factors significant at the p = .12
level.  These were Karnovsky score at t coded as one if the Karnovsky
score was 75 or less and zero otherwise; asthenia score, coded as one
if the asthenia score was two or greater at t, and hemoglobin at t,
coded as one if less than or equal to eight and zero otherwise. The
estimated hazard ratios were 4.2, 2.2, 4.5, respectively. Conditional
on these three variables the prognostic factors white blood count,
PCP, and CD4 count did not significantly predict the hazard of death.
The reader may be surprised, given the well-known prognostic value of
CD4 and PCP in AIDS patients, AIDS patients, that they were not
independent predictors of mortality. However, standard analyses do not
usually adjust for factors such as Karnovsky score and asthenia, which
are quite sensitive measures of a patient's current clinical condition
and thus may render CD4 count and PCP history nonpredictive
conditional on the values of these factors.

We wish to emphasize that the choice of the significance level p = .15
for variable inclusion or exclusion is somewhat ad hoc. As discussed
in detail by Robins and Greenland (1986), a more formal, less ad hoc
approach might be to elicit a subjective prior distribution for the
joint distribution of all the unknown parameters in the model and
carry out a full Bayesian analysis. However, such an approach lies
outside the scope of the present paper.
</pre>
</div>
</div>

<ul class="org-ul">
<li>Discuss pros and cons of dichotomizing the continuous variables.</li>
<li>Discuss the pros and cons of removing variables from the regression models.</li>
<li>What would be a better criterion than a threshold on the p-values from hazard ratio tests?</li>
<li>Discuss how you would approach modelling the propensity of treatment continuation
conditional on all 6 predictor variables (Karnovsky score, Asthenia
score, hemoglobin, white blood count, CD4 count, pneumocystis
pneumonia).</li>
</ul>
</div>
</div>
<div id="outline-container-org7e13628" class="outline-3">
<h3 id="org7e13628"><span class="section-number-3">2.3.</span> Design</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Suppose a package of bactrim contains 45 pills and a patient is
supposed to take one pill per day as a longterm prophylactic
treatment. How would you define the \(A_1\) variable when the time
interval length of the discretized time scale is 3 months and you
know the drug prescription dates?</li>
<li>Suppose you have data from a patient who has both a PCP event and
also gets lost to followup in time interval 1. How would you code
the variables \(Y_1, C_1, D_1\) for this patient?</li>
<li>What values do the treatment variables have for
<ul class="org-ul">
<li>a person who initiated AP and then "crossed-over" to use bactrim</li>
<li>a person who initiated bactrim and then stopped treatment</li>
</ul></li>
<li>Suppose your task is to fit a logistic regression model for the risk
of PCP in time interval 2:
<ul class="org-ul">
<li>Who do you include in the analysis?</li>
<li>What is the interpretation of the odds?</li>
<li>Suppose only 4 people above 80 contribute to the analysis and they all 
stop treatment. Is this a problem and if yes, what can you do about it?</li>
</ul></li>
<li>Consider specifying an outcome regression at time 8. How would you
propose to model the effects of the 16 treatment variables?</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7d6a777" class="outline-2">
<h2 id="org7d6a777"><span class="section-number-2">3.</span> Practical 3</h2>
<div class="outline-text-2" id="text-3">
<p>
Work through the section 'Code for practicals III' in the R-markdown file <a href="./demo-rtmle-survival.Rmd">./demo-rtmle-survival.Rmd</a> 
</p>
</div>
</div>
<div id="outline-container-orgf458092" class="outline-2">
<h2 id="orgf458092"><span class="section-number-2">4.</span> Practical 4</h2>
<div class="outline-text-2" id="text-4">
<p>
Work through the section 'Code for practicals IV' in the R-markdown file <a href="./demo-rtmle-survival.Rmd">./demo-rtmle-survival.Rmd</a> 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 16 sep 2025 by Thomas Alexander Gerds.
</div>
</body>
</html>
